# 1.
# Дан список чисел. Выведите те его элементы, которые встречаются в списке только один раз.
# Элементы нужно выводить в том порядке, в котором они встречаются в списке

# sp = input("Введите список").split()
# sp_1 = []
# for i in sp:
#     if sp.count(i) == 1:
#         sp_1.append(i)
#         print(sp_1)
